------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  W:\C6_Fang\WMH\Projects\Yihui\Sexdiff_suicide\output/Figure3.log
  log type:  text
 opened on:  25 Dec 2024, 18:00:37

. 
. 
. * Import data
. use "data/data1.dta", clear

. append using "data/data2.dta" "data/data3.dta", generate(newv)
(label cal already defined)
(label agec already defined)
(label agec already defined)
(label cal already defined)

. gen prd=newv+1

. drop newv

. 
. 
. foreach i of num 0/1{ 
  2.         
. preserve
  3. 
. keep if far==`i'
  4. 
. * Merge with data on spline
. merge m:1 wk using "data/fig3_wksp`i'.dta"
  5. drop _merge
  6. 
. replace prd=prd-1
  7. *Note now the value of prd is: 0,1,2
. 
. *regression
. poisson _d i.prd##c.wksp* i.agec i.cal i.edu i.marr i.income i.firstpreg i.fland i.psy i.sui_his, irr exp(
> fu)
  8. 
. *predict log IRR
. predictnl rr= _b[1.prd]+_b[1.prd#wksp1]*wksp1+_b[1.prd#wksp2]*wksp2+_b[1.prd#wksp3]*wksp3 if prd==1, ci(lb
>  ub)
  9. predictnl rr1= _b[2.prd]+_b[2.prd#wksp1]*wksp1+_b[2.prd#wksp2]*wksp2+_b[2.prd#wksp3]*wksp3 if prd==2, c
> i(lb1 ub1)
 10. 
. replace rr=rr1 if prd==2
 11. replace lb=lb1 if prd==2
 12. replace ub=ub1 if prd==2
 13. 
. * save estimates
. keep if prd == 1 | prd == 2
 14. keep prd wk rr lb ub
 15. gen far=`i'
 16. save output/figure3_`i', replace
 17. restore
 18. }
(2,590,225 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         2,599,760  (_merge==3)
    -----------------------------------------
(2,599,760 real changes made)

Iteration 0:  Log likelihood = -38931.393  
Iteration 1:  Log likelihood = -38727.064  
Iteration 2:  Log likelihood = -38726.771  
Iteration 3:  Log likelihood =  -38726.77  

Poisson regression                                   Number of obs = 2,599,760
                                                     LR chi2(35)   =  17669.53
                                                     Prob > chi2   =    0.0000
Log likelihood = -38726.77                           Pseudo R2     =    0.1858

------------------------------------------------------------------------------
          _d |        IRR   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         prd |
          1  |   .9543514   .0809318    -0.55   0.582     .8082094    1.126919
          2  |   .1347109   .0171179   -15.78   0.000     .1050121    .1728088
             |
       wksp1 |   .9782664   .0050541    -4.25   0.000     .9684105    .9882227
       wksp2 |   1.067912   .0199297     3.52   0.000     1.029556    1.107696
       wksp3 |    .836969    .042856    -3.48   0.001     .7570502    .9253246
             |
 prd#c.wksp1 |
          1  |   .9083492   .0095288    -9.16   0.000     .8898637    .9272187
          2  |   1.082653   .0127071     6.77   0.000     1.058032    1.107847
             |
 prd#c.wksp2 |
          1  |    1.30783   .0610098     5.75   0.000     1.193556    1.433044
          2  |   .8510833   .0325917    -4.21   0.000     .7895431    .9174201
             |
 prd#c.wksp3 |
          1  |   .4835254   .0766143    -4.59   0.000     .3544434    .6596169
          2  |    1.44629    .146515     3.64   0.000     1.185837    1.763947
             |
        agec |
        20-  |   .6145662   .0253528   -11.80   0.000     .5668314    .6663209
        25-  |   .3926078   .0179395   -20.46   0.000     .3589756     .429391
        30-  |   .3513518    .017752   -20.70   0.000     .3182257    .3879262
        35-  |   .3291343   .0193346   -18.92   0.000     .2933393    .3692972
        40-  |   .3061849   .0282587   -12.82   0.000     .2555195    .3668965
             |
         cal |
      2006-  |   .9262474   .0301603    -2.35   0.019     .8689811    .9872877
      2011-  |   .7785892   .0273933    -7.11   0.000     .7267087    .8341736
      2016-  |   .7047874   .0271054    -9.10   0.000     .6536146    .7599666
             |
         edu |
          2  |   .6596962   .0198587   -13.82   0.000     .6218998    .6997897
          3  |   .3993398   .0160692   -22.81   0.000     .3690548    .4321101
          9  |   .9308803   .0581456    -1.15   0.252     .8236168    1.052113
             |
      2.marr |   1.979317   .0569594    23.73   0.000     1.870769    2.094164
             |
      income |
          1  |   .8930386   .0277571    -3.64   0.000     .8402597    .9491328
          2  |   .7413197   .0280904    -7.90   0.000     .6882583    .7984718
          3  |   .5994064    .027448   -11.18   0.000     .5479528    .6556915
          4  |   .5897703   .0321417    -9.69   0.000     .5300215    .6562545
          9  |   .9683281   .1231623    -0.25   0.800      .754671    1.242474
             |
 1.firstpreg |   1.094256   .0312532     3.15   0.002     1.034684    1.157258
             |
       fland |
          2  |   1.033588   .0492681     0.69   0.488     .9413975    1.134806
          3  |   1.071931   .0382499     1.95   0.052     .9995243    1.149584
          9  |   2.966497   2.967741     1.09   0.277     .4175277    21.07669
             |
         psy |
          1  |   3.413934   .1227756    34.14   0.000     3.181583    3.663253
          2  |   3.391304   .1002154    41.33   0.000     3.200466    3.593523
             |
   1.sui_his |   5.461194   .1553132    59.69   0.000     5.165114    5.774246
       _cons |   .0000169   1.21e-06  -154.18   0.000     .0000147    .0000195
      ln(fu) |          1  (exposure)
------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate.
(1,843,743 missing values generated)
note: confidence intervals calculated using Z critical values.
(1,712,332 missing values generated)
note: confidence intervals calculated using Z critical values.
(887,428 real changes made)
(887,428 real changes made)
(887,428 real changes made)
(956,315 observations deleted)
file output/figure3_0.dta saved
(2,599,760 observations deleted)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         2,590,225  (_merge==3)
    -----------------------------------------
(2,590,225 real changes made)

Iteration 0:  Log likelihood = -44972.515  
Iteration 1:  Log likelihood = -43983.653  
Iteration 2:  Log likelihood = -43975.527  
Iteration 3:  Log likelihood = -43975.427  
Iteration 4:  Log likelihood = -43975.409  
Iteration 5:  Log likelihood = -43975.407  
Iteration 6:  Log likelihood = -43975.406  
Iteration 7:  Log likelihood = -43975.406  
Iteration 8:  Log likelihood = -43975.406  

Poisson regression                                   Number of obs = 2,590,225
                                                     LR chi2(35)   =  12220.21
                                                     Prob > chi2   =    0.0000
Log likelihood = -43975.406                          Pseudo R2     =    0.1220

------------------------------------------------------------------------------
          _d |        IRR   Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         prd |
          1  |   1.220455     .10921     2.23   0.026     1.024127     1.45442
          2  |    .701637   .0659669    -3.77   0.000     .5835576    .8436091
             |
       wksp1 |   .9873805   .0062333    -2.01   0.044     .9752388    .9996733
       wksp2 |   1.031417   .0234201     1.36   0.173     .9865213    1.078357
       wksp3 |   .9157926   .0570516    -1.41   0.158     .8105307    1.034725
             |
 prd#c.wksp1 |
          1  |    .988193   .0094686    -1.24   0.215     .9698081    1.006926
          2  |   1.034034   .0096659     3.58   0.000     1.015261    1.053153
             |
 prd#c.wksp2 |
          1  |   1.054009   .0402702     1.38   0.169     .9779641    1.135968
          2  |   .9155742    .029895    -2.70   0.007     .8588166    .9760828
             |
 prd#c.wksp3 |
          1  |   .8164176   .0990784    -1.67   0.095     .6435951    1.035648
          2  |   1.263625   .1119092     2.64   0.008     1.062268     1.50315
             |
        agec |
        20-  |   .8983597   .0643455    -1.50   0.135      .780697    1.033756
        25-  |   .6556727   .0467538    -5.92   0.000     .5701521     .754021
        30-  |   .5344667   .0389579    -8.59   0.000     .4633142    .6165464
        35-  |   .4639209   .0351285   -10.14   0.000     .3999357    .5381429
        40-  |   .4072848    .031982   -11.44   0.000     .3491867    .4750493
             |
         cal |
      2006-  |   1.089244   .0341098     2.73   0.006       1.0244    1.158192
      2011-  |   .9481036   .0319374    -1.58   0.114     .8875292    1.012812
      2016-  |   .8356237   .0307219    -4.88   0.000     .7775282      .89806
             |
         edu |
          2  |   .7136822   .0197446   -12.19   0.000     .6760139    .7534494
          3  |   .4264992   .0160126   -22.70   0.000      .396242    .4590669
          9  |   .8497429    .074097    -1.87   0.062     .7162479    1.008119
             |
      2.marr |   2.204101   .0609242    28.59   0.000     2.087869    2.326804
             |
      income |
          1  |   .8870722   .0277042    -3.84   0.000     .8344015    .9430677
          2  |   .6824647   .0238973   -10.91   0.000      .637198    .7309472
          3  |   .6249241   .0234478   -12.53   0.000     .5806163     .672613
          4  |   .5403733   .0229227   -14.51   0.000     .4972627    .5872215
          9  |    .388835   .0658098    -5.58   0.000     .2790619    .5417889
             |
 1.firstpreg |   .9398038   .0228912    -2.55   0.011     .8959921    .9857579
             |
       fland |
          2  |   .8812454   .0382634    -2.91   0.004     .8093529    .9595239
          3  |   .6910945   .0263446    -9.69   0.000     .6413418    .7447069
          9  |   9.78e-06   .0042401    -0.03   0.979            0           .
             |
         psy |
          1  |   2.574598   .1017255    23.93   0.000     2.382744    2.781899
          2  |   2.756774   .0752827    37.13   0.000     2.613102    2.908345
             |
   1.sui_his |   6.515184   .1876248    65.08   0.000     6.157631    6.893498
       _cons |   .0000106   1.04e-06  -117.33   0.000     8.78e-06    .0000129
      ln(fu) |          1  (exposure)
------------------------------------------------------------------------------
Note: _cons estimates baseline incidence rate.
(1,863,655 missing values generated)
note: confidence intervals calculated using Z critical values.
(1,673,410 missing values generated)
note: confidence intervals calculated using Z critical values.
(916,815 real changes made)
(916,815 real changes made)
(916,815 real changes made)
(946,840 observations deleted)
file output/figure3_1.dta saved

. 
. 
. **
. ** visulize
. **
. * load estimates
. clear

. append using output/figure3_0 output/figure3_1

. 
. *collapse
. collapse (first) rr* lb* ub*, by(wk prd far)

. 
. * exclusion
. drop if prd==1 & wk>40 
(12 observations deleted)

. 
. * exp 
. replace rr = exp(rr)
(186 real changes made)

. replace lb = exp(lb)
(186 real changes made)

. replace ub = exp(ub)
(186 real changes made)

. 
. * label
. label define px 1 "Antepartum" 2 "Postpartum"

. label values prd px

. 
. 
. * plot 
. twoway ///
>     (rarea lb ub wk if far==0, sort color(pink) lw(none) fi(inten30))  ///
>         (scatter rr wk if far==0, msymbol(o) msize(tiny) mcolor(red) connect(direct) lcolor(red) sort) ///
>     (rarea lb ub wk if far==1, sort color(ltblue) lw(none) fi(inten30)) ///
>         (scatter rr wk if far==1, msymbol(o) msize(tiny) mcolor(midblue) connect(direct) lcolor(navy) sort
> ), ///
> by(prd, rows(1) ixaxes iyaxes graphregion(color(white)) note("") legend(position(6))) ///
> legend(order(2 4) lab(2 "Mothers") lab (4 "Fathers") rows(1) region(lcolor(white)) size(vsmall)) graphregi
> on(color(white)) scale(.8) ///
> xlabel(0(5)53) ///
> yline(1, lp(solid) lc(black) lw(medium)) ///
> ytitle("Incidence rate ratio") ///
> xtitle("Week") ///
> saving(output/figure3,replace) 
file output/figure3.gph saved

. 
. 
. * output
. graph use output/figure3

. graph export output/figure3.jpg, replace
file output/figure3.jpg written in JPEG format

. 
. log close
      name:  <unnamed>
       log:  W:\C6_Fang\WMH\Projects\Yihui\Sexdiff_suicide\output/Figure3.log
  log type:  text
 closed on:  25 Dec 2024, 18:10:03
------------------------------------------------------------------------------------------------------------
